[Demo_Tutorial_DokiDoki_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[2]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[3]=(Actor=TUT_TEXTURE,Command=START,CId=1,Bit=0)
DemoScripts[4]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Usual_Ekoro.GG2_BGM_DM_Usual_Ekoro_Cue')
DemoScripts[5]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[6]=(Actor=FADE,Command=WAIT)
DemoScripts[7]=(Actor=WINDOW,Command=SET)
DemoScripts[8]=(Actor=SYSTEM,Command=TAG,Label=JUMP01)
DemoScripts[9]=(Actor=TUT_TEXTURE,Command=SET,CId=1,Bit=1)
DemoScripts[10]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[14]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=2,Bit=2)
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[18]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=3,Bit=3)
DemoScripts[19]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[24]=(Actor=SELECT,Command=SET,ID=SELECT00)
DemoScripts[25]=(Actor=SYSTEM,Command=TAG,Label=JUMP02)
DemoScripts[26]=(Actor=WINDOW,Command=EXIT)
DemoScripts[27]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[28]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[29]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[30]=(Actor=SYSTEM,Command=END)

[Select_Tutorial_DokiDoki_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=2,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Tutorial_DokiDoki_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="能夠讓女孩子一口氣神魂顛倒,/n那就是這次的心跳模式!")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="總之先試著戳戳看(Y鍵)/n她們可能會有感覺的部位......")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="或是磨蹭看看/n(按住Y鍵並移動視點)/n藉此累積心跳量值.")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="在時間限制內集滿女孩子的/n心跳量值,接著昇天終結!/n這樣就能獲得大量的受歡迎點數了!")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="女孩子有敏感的部位,/n反之也有不喜歡的部位./n透過接觸時的特效來判斷吧.")

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="即使是同樣的部位,戳的時候/n和磨蹭時的反應好像也會有所不同唷.")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="要是想瞄準的部位被遮住的話,/n可以用L,R鍵切換鏡頭./n不過只限於有在販賣部購買的情況下啦......")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="在射擊關卡中/n只要存有超過1顆愛心量值/n就能按X鍵發動心跳模式.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="發動後女孩子們會暫時/n處於暈眩狀態,/n請冷靜選擇要當作目標的女孩子喔.")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="如果能在心跳模式內讓女孩子昇天,/n參數就會產生增減.還有還有,/n回到關卡時還會發動心跳炸彈!")

Texts[10]=(Label="TEXT11",Name="艾可蘿",Text="心跳炸彈是可以讓畫面內/n所有女孩子同時昇天的必殺技!")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="要是被許多女孩子包圍的話,/n不要猶豫,發動心跳模式吧!/n能夠化危機為轉機喔!")

Texts[12]=(Label="",Name="",Text="")

Texts[13]=(Label="SELECT01",Name="",Text="重來一次")

Texts[14]=(Label="SELECT02",Name="",Text="沒問題了")

Texts[15]=(Label="SELECT03",Name="",Text="")

Texts[16]=(Label="SELECT04",Name="",Text="")

Texts[17]=(Label="SELECT05",Name="",Text="")

Texts[18]=(Label="SELECT06",Name="",Text="")

Texts[19]=(Label="SELECT07",Name="",Text="")

Texts[20]=(Label="SELECT08",Name="",Text="")

Texts[21]=(Label="SELECT09",Name="",Text="")

Texts[22]=(Label="SELECT10",Name="",Text="")


